Can't change Work Plane Visibility.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotChangeWorkplaneVisibility { get; }
  Visual Basic
Public Shared ReadOnly Property CannotChangeWorkplaneVisibility As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotChangeWorkplaneVisibility {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace